desafio-ror/app/controllers/home_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @products = Product.all
    @post = Post.last