desafio-ror/app/controllers/posts_controller.rb

INSERT INTO "posts" ("imagen", "title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["imagen", ""], ["title", ""], ["content", ""], ["created_at", "2022-10-27 00:46:57.534394"], ["updated_at", "2022-10-27 00:46:57.534394"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save