desafio-ror/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("imagen", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["imagen", "probando "], ["title", "titulo "], ["description", "description"], ["created_at", "2022-10-27 01:05:31.449926"], ["updated_at", "2022-10-27 01:05:31.449926"]]